Revit 2027 API
Document.IsValidVersionGUID Method
 Checks whether the GUID is valid for the given document. Empty GUID is allowed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidVersionGUID(
	Document document,
	Guid versionGUID
)
Public Shared Function IsValidVersionGUID (
	document As Document,
	versionGUID As Guid
) As Boolean
public:
static bool IsValidVersionGUID(
	Document^ document,
	Guid versionGUID
)
static member IsValidVersionGUID :
        document : Document *
        versionGUID : Guid -> bool
Parameters
document Document
 Target document.
versionGUID Guid
 The GUID to check.
Return Value
Boolean
 True if the GUID is valid.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace